Ran Plan for dir: `cdktf-aws/ci-cdktf.out/stacks/stack-1-staging` workspace: `default`

<details><summary>Show Output</summary>

```diff
aws_s3_bucket.bucket: Refreshing state... [id=test-04c2b2a32]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_bucket.bucket must be replaced
-/+ resource "aws_s3_bucket" "bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::test-04c2b2a32" -> (known after apply)
      ~ bucket                      = "test-04c2b2a32" -> "test-04c2b2a321" # forces replacement
      ~ bucket_domain_name          = "test-04c2b2a32.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "test-04c2b2a32.s3.ap-northeast-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z2M4EHUR26P7ZW" -> (known after apply)
      ~ id                          = "test-04c2b2a32" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "ap-northeast-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ tags_all                    = {} -> (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (1 unchanged attribute hidden)

      - grant {
          - id          = "d67719f3cfe705ab0603c2bf3f96af75ca29c6d258bcf8c358769c8ca989c570" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d cdktf-aws/ci-cdktf.out/stacks/stack-1-staging`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.staging-meetsmore.com/lock?id=keidarcy%252Fatlantis-example%252Fcdktf-aws%252Fci-cdktf.out%252Fstacks%252Fstack-1-staging%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d cdktf-aws/ci-cdktf.out/stacks/stack-1-staging`
</details>
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`